{"company_url": "aeti.com", "jobs_opportunities": {"Field Service Technician": "[u'American Electric Technologies, Inc. (AETI) is a leading provider of global power delivery solutions to the energy industries. The company has been in the energy industry for 68 years, and is now an $80M, NASDAQ-listed company with over 500 employees worldwide.  The company is public and progressively growing and remains focused on delivering solutions that exceed the customers\\u2019 expectations. If you are interested in joining a highly motivated winning team of excellence, and have the knowledge and experience as a Field Service Technician in the oil and gas industry, M&I Electric Industries (An AETI Company) headquartered in Houston, Texas has an amazing career opportunity.', u'\\xa0', u'M&I Electric Industries, Inc.  offers very competitive compensation packages and comprehensive benefits plan including 401(k), Employee Stock Purchase Plan, medical, paid time off, short & long term disability, life insurance, flex spending accounts, etc.'][u'Promote & maintain a safe working environment for the team & adhere to the companies safety policies and procedures', u'Field experience with electrical and electronic systems', u'Intermediate to advanced analog and digital DC motor drives; \\u201cRoss Hill\\u201d style systems preferred', u'Intermediate to advanced analog and digital AC motor drives; 690V class IGBT systems preferred', u'Intermediate to advanced PLC programming experience; Wago, Allen Bradley, Siemens preferred', u'Three phase electrical power conversion up to 4160V', u'Motor Control Centers', u'Digital Communications systems; various protocols such as Modbus, CANbus, TCP/IP, etc.', u'Proficient with MS Office software', u'AC and DC motor theory', u'Engine-Generator controllers', u'Knowledge of and experience with Multi-meters, Oscilloscopes, and other General Purpose Electrical Test Equipment', u'Strong verbal and written communication skills', u'Ability to interface with customers effectively', u'Oversees travel up to 75% of the time; road warrior', u'Minimum 5 years experience as an Electrical Field Service Technician and proven track record', u'Experience in drilling or marine industries preferred', u'Passport required', u'Transportation Worker Identification Card (TWIC) required']", "Senior Account Manager - Bay St. Louis, MS": "[u'M&I Electric Industries, Inc. an AETI Company is a leading provider of global power delivery solutions to the energy industries. The company has been in the energy industry for 68 years, and is now an $80M, NASDAQ-listed company with over 500 employees worldwide.  The company is public and progressively growing and remains focused on delivering solutions that exceed the customers\\u2019 expectations. If you are interested in joining a highly motivated winning team of excellence, and have the knowledge and experience as a Senior Account Manager in the oil and gas industry, our South Coast Electric subsidiary located in Bay St. Louis, Mississippi (An AETI Company) has an amazing career opportunity.     In this role you will report directly to the director sales for the oil & gas sector.   ', u'PRIMARY FUNCTIONS', u'Responsibilities include securing opportunities from the dynamic midstream oil & gas sector either direct from the end users or via the EPC companies executing these projects.  Review and interpret project scopes and deliverables and communicate this information to the inside sales/application engineering team.  Communicate proper lead time information, have a reasonable technical understanding of the products and provide market feedback to support strategic decisions of the management team.  Improve market awareness of the M&I Electric brands, product offerings and company capabilities.  Act as the voice of the customer to the management team.  Meet or exceed sales targets in the market segment as determined by the director of sales based on available market data for the sector. ', u'ESSENTIAL FUNCTIONS ', u'Perform a wide variety of sales and marketing tasks; this includes solving customer problems with the use of company technical and marketing materials, provide assistance in developing specifications and supporting customers with company technical solutions.  Without appreciable direction, must be able to manage time appropriately to meet and exceed the sales objectives and customers\\u2019 requirements.  Negotiate contracts and with customers.  Give informative product and company capabilities presentations to customers.     ', u'QUALIFICATIONS ', u'1.\\tBachelor\\u2019s degree in electrical engineering or equivalent', u'\\n2.\\tMinimum of 15 years of experience in electrical capital equipment sales and or  services', u'\\n3.\\tStrong leadership skills, strong negotiating skills, excellent verbal and written communication skills, positive attitude', u'\\n4.\\tBasic understanding of prefabricated electrical substation buildings', u'\\n5.\\tSwitchgear product knowledge a plus', u'\\n6.\\tPositive attitude', u'\\n7.\\tSolves complex problems in support of business strategy', u'\\n8.\\tExperience giving presentations', u'\\n9.\\tSkilled at closing a deal', u'\\n10.\\tExperience with Salesforce.com or other CRM software  ', u'COMPENSATION', u'South Coast Electric Systems, LLC  offers very competitive compensation packages and comprehensive benefits plan including 401(k), Employee Stock Purchase Plan, medical, paid time off, short & long term disability, life insurance, flex spending accounts, etc.  The compensation packages include a strong base component with highly motivating commission plan..  As a small publicly traded company, the company is also able to include a very attractive equity incentive.  Over 68 years in the energy market place, global footprint, innovative, progressive, and nimble infrastructure that allows for solutions to be delivered quickly! It\\u2019s a great company and a great place to work!'][]"}, "company_name": "American Electric Technologies, Inc."}